###########################
#과목명: 데이터 애널리틱스
#과제명: 실습과제1_R기초 
#이름: 이윤설
#학번: 2015113412
#학과: 경영학부
###########################


HW1 <- data.frame(요리명=c("김밥","떡볶이","라면","간장게장","된장국"),
                  주재료=c("김","떡","면","게","된장"),
                  부재료1=c("계란","고추장","파","간장","시래기"),
                  부재료2=c("단무지","어묵","양파","고추","고춧가루"),
                  주문개수=c(45,23,2,8,10),
                  난이도=factor(c("HIGH","LOW","HIGH","LOW","LOW")),
                  주문확인=c(FALSE,TRUE,TRUE,FALSE,TRUE)
                  )

View(HW1)
View(HW1[c(1, 5), c("난이도", "요리명")])

barplot(HW1$주문개수, names.arg = HW1$요리명, xlab = "요리명", ylab = "주문개수",
        main = "주문 개수별 요리명", 
        col = topo.colors(nrow(HW1)))
